#+title: Release Notes for Sprint 37
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 37.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-10-25 Fri 00:19]

| Headline                                          | Time   |      |      |
|---------------------------------------------------+--------+------+------|
| *Total time*                                      | *4:13* |      |      |
|---------------------------------------------------+--------+------+------|
| Development Stories Implemented                   |        | 4:13 |      |
| IMPLEMENTATION Release notes and backlog grooming |        |      | 0:06 |
| COMPLETED Add types header formatter to workflow  |        |      | 4:07 |
#+end:

*** IMPLEMENTATION Release notes and backlog grooming                  :task:
    CLOCK: [2013-10-21 Mon 07:53]--[2013-10-21 Mon 07:59] =>  0:06

*** COMPLETED Add types header formatter to workflow                  :story:
    CLOSED: [2013-10-24 Thu 20:28]
    CLOCK: [2013-10-24 Thu 08:22]--[2013-10-24 Thu 08:33] =>  0:11
    CLOCK: [2013-10-24 Thu 07:51]--[2013-10-24 Thu 08:17] =>  0:26
    CLOCK: [2013-10-21 Mon 08:32]--[2013-10-21 Mon 08:40] =>  0:08
    CLOCK: [2013-10-21 Mon 08:14]--[2013-10-21 Mon 08:17] =>  0:03
    CLOCK: [2013-10-21 Mon 07:59]--[2013-10-21 Mon 08:14] =>  0:15

**** COMPLETED Change type formatter interface
     CLOSED: [2013-10-21 Mon 20:44]
     CLOCK: [2013-10-21 Mon 19:45]--[2013-10-21 Mon 20:00] =>  0:15
     CLOCK: [2013-10-21 Mon 18:20]--[2013-10-21 Mon 18:53] =>  0:33
     CLOCK: [2013-10-21 Mon 18:19]--[2013-10-21 Mon 18:20] =>  0:01

- no stream
- returns a file

**** COMPLETED add all types traversal and hook it up to workflow
     CLOSED: [2013-10-25 Fri 00:19]
     CLOCK: [2013-10-24 Thu 22:40]--[2013-10-25 Fri 00:19] =>  1:39
     CLOCK: [2013-10-24 Thu 18:14]--[2013-10-24 Thu 18:46] =>  0:32
     CLOCK: [2013-10-24 Thu 18:10]--[2013-10-24 Thu 18:14] =>  0:04

*** Add tests for tagging of abstract objects                         :story:

** Deprecated Development Stories
